{
  "Why strong passwords?": "Perchè password forti?",
  "Strong passwords never forgotten": "Password forti mai più dimenticate",
  "Why should I use it?": "Perchè dovrei usarlo?",
  "How it works?": "Come funziona?",
  "Do you want to have different passwords for each website, that are strong and complex, without having to remember them all and without having to write them down or saving them somewhere?": "Vuoi avere password diverse per ogni sitoweb che siano forti e complesse senza dover ricordarle tutte e senza dover scriverle o salvarle da qualche parte?",
  "Haipass is a service": "Haipass è un servizio",
  "Haipass is a free service to help you have strong, long, complicated passwords for your accounts without the need to remember them. The only thing that you have to remember is just a secret word or phrase.": "Haipass è un servizio <b>GRATUITO</b> per aiutarti ad avere delle password forti, lunghe e complicate, per i tuoi account, senza che tu debba ricordarle. L'unica cosa che dovrai ricordare sarà soltanto una frase segreta.",
  "I want to try it": "Voglio provarlo",
  "Why do I need strong passwords?": "Perchè ho bisogno di avere password forti?",
  "Because finding your own simple password is really easy for crackers while finding a strong and complex one is really very difficult": "perchè trovare una tua password semplice è davvero facile per i crackers mentre una forte e complessa è davvero molto difficile",
  "Guessing": "Indovinando",
  "A cracker might try to guess your passwords using probable words like your birthday, where you were born, your son's name, etc..." : "Un cracker potrebbe cercare di indovinare le tue password utilizzando probabili parole come il tuo compleanno, il luogo dove sei nato, il nome di tuo figlio, etc...",
  "Brute force" : "Forza bruta",
  "A cracker with a brute force attack merely tries combination over combinations until he finds your password. So if the password is short or simple it can be easily guessed.": "Un cracker con un attacco forza bruta non fa altro che provare combinazioni su combinazioni fino a trovare la tua password. Quindi se la password è corta o semplice puà essere facilmente indovinabile.",
  "Dictionary (online)": "Dizionario (online)",
  "A cracker uses an automatic program that, using a file with words commonly used as a password, attempts to login to the site with every word in the file." : "Un cracker usa un programma automatico che, usando un file con delle parole comunemente usate come password, fa un tentativo di login nel sito con ogni parola presente nel file.",
  "Dictionary (offline)" : "Dizionario (offline)",
  "If the cracker manages to get the database containing users passwords of a particular web site as a text file, he can use it to do unhindered attempts.": "se il cracker riesce a ottenere il database delle password di un determinato sito web come un file di testo, potrebbe usarlo per fare tentativi senza impedimenti.",
  "I want to use Haipass for the password of my Facebook acount. Let me know how to do it." : "Voglio usare Haipass per la password del mio acount Facebook. Fammi capire come fare.",
  "Come to" : "Vieni su",
  "and enter in the 'Website or application name' input (the first field) The word 'Facebook'. Then enter a secret phrase, that only you know,  in the 'secret phrase' field (the second field). This is your secret key that will be used to generate all your passwords. Do not forget it, and you don't lose it, otherwise you will need to reset your passwords for all of your accounts that you have used Haipass." : "e inserisci nella casella 'Nome sito web o applicazione' (il primo campo) la parola 'Facebook'. Poi nel campo 'frase segreta' (il secondo campo) inserisci una frase segreta che solo tu sai. Questa è la tua chiave che ti farà avere tutte le tue password. Non te la dimenticare e non la perdere altrimenti dovrai reimpostare le tue password nei vari account.",
  "Click the 'My Password' button and copy the password that Haipass will generate (you can copy it by clicking on the icon on the screen that will appear to you)." : "Clicca sul pulsante 'La mia password' e copia la password che Haipass ti genererà (la puoi copiare cliccando sull'icona nella schermata che ti apparirà).",
  "Use the copied password for your facebook account (Your facebook password can be set both in the registration step or through the settings panel)." : "Usa la password copiata per il tuo account facebook (La tua password facebook può essere impostata sia nella fase di registrazione che attraverso il panello delle impostazioni).",
  "Every time you need to log in on Facebook, come back to" : "Ogni volta che dovrai accedere su Facebook, torna su",
  "So simple? Now I want to use Haipass also for my Google account. Let me see how to do it.": "Cosi semplice? Ora voglio usare Haipass anche per il mio account Google. Fammi vedere come fare.",
  "Come back to" : "Torna su",
  "and this time enter the word 'Google' in the 'Website name or application' input (the first field). Then in the 'secret phrase' input (the second field) enter your secret phrase (the same one you used to generate the password for the facebook account in the example above)." : "e stavolta inserisci nel campo 'Nome sito web o applicazione' (il primo campo) la parola 'Google'. Poi nella casella 'frase segreta' (il secondo campo) inserisci la tua frase segreta (la stessa che hai usato per generare la password per l'account facebook nell'esempio sopra).",
  "Click the 'My Password' button and copy the password that Haipass will generate (you can copy it by clicking on the icon on the screen that will appear to you)." : "Clicca sul pulsante 'La mia password' e copia la password che Haipass ti genererà (la puoi copiare cliccando sull'icona nella schermata che ti apparirà).",
  "Use the copied password for your Google Account (Your Google password can be set either in the registration phase or through the settings panel).": "Usa la password copiata per il tuo account Google. (La tua password Google può essere impostata sia nella fase di registrazione che attraverso il panello delle impostazioni).",
  "Now every time you need to log in to Google, go back to" : "Ora, ogni volta che dovrai accedere su Google, torna su",
  "put the word 'Google' in the first field, put the secret phrase in the second field and click the 'My Password' button. Copy your password and use it to log in." : "rimetti la parola 'Google' nel primo campo, metti la frase segreta nel secondo campo e clicca sul pulsante 'La mia password'. Copia la tua password e usala per accedere.",
  "I understood, thanks!" : "Ho capito, grazie!",
  "Why should I use Haipass?" : "Perchè dovrei usare Haipass?",
  "To avoid the need of remembering your passwords or the need to write them down": "Per evitare di dover ricordare o scrivere le tue password",
  "Haipass frees you from remember or write down the passwords generated. You just need to remember the name of the site and your secret phrase. So no more files with passwords around, no more passwords stored in browsers and no more passwords put on a database of a password manager." : "Haipass ti permette di non dover ricordare o scrivere le password generate. Sarà sufficiente ricordare il nome del sito e una tua frase segreta. Quindi niente più files con password, password immagazzinate nei browser o messe su un database di un password manager.",
  "Different strong passwords for each website" : "Diverse password forti per ogni sito web",
  "To have strong passwords that can not be guessed with the various types of attacks. Haipass passwords have a very high entropy and even with the most powerful computers it would take millions of years to find them." : "Per avere delle password forti impossibili da indovinare con i vari tipi di attacchi. Le password di Haipass hanno un entropia molto elevata e anche con i computer più potenti ci vorrebbero milioni di anni per trovarle.",
  "To always have your passwords on any device or operating system" : "Per avere sempre le tue password su qualsiasi dispositivo o sistema operativo",
  "Whether you are with your PC, or with your cell phone, or your tablet, or whether you're at a friend's home on his PC, it's enough to come to haipass.com and get your passwords." : "Sia che tu sia con il pc, o con il cellulare o tablet, o che tu sia a casa di un amico sul suo pc sarà sufficiente venire su haipass.com e ottenere le tue password.",
  "Fast and easy" : "Facile e veloce",
  "To have your passwords you do not have to sign up, neither log in nor pay. You do not have to do anything other than writing the site name and your secret phrase and clicking one button." : "Per avere le tue password non devi nè registrarti, nè accedere e nè pagare. Non devi fare niente oltre a scrivere il nome del sito e la tua frase segreta e cliccare un pulsante.",
  "Is Haipass secure?" : "Haipass è sicuro?",
  "Use ssl for encrypted data transmission. In this way, no one will be able to intercept the transmission of your secret phrase, nor the generated passwords." : "<b>Utlizza ssl</b> per una trasmissione dei dati crittografata. In questo modo nessuno potrà intercettare la trasmissione della tua frase segreta e nemmeno  le password generate.",
  "The algorithm used to generate the passwords uses a hash function of your secret phrase with a secret key that only Haipass has. In this way it is impossible for a craker to bruteforce with dictionary (both online and offline) to find out your secret password." : "L'algoritmo utilizzato per generare le password usa una funzione di hash della tua frase segreta con una chiave segreta che solo Haipass ha. In questo modo è impossibile che un craker riesca a fare bruteforce con dizionario (sia online che offline) per scoprire la tua password segreta.",
  "None of your passwords generated with Haipass <b> are NEVER Saved anywhere </ b>. See Haipass as a pure function that has two inputs: the secret phrase and name of the site you want to access.Given those inputs it will always generate the same output. Also since you do not have to sign up and you do not have an account on Haipass you will not need to save your passwords.": "Nessuna delle tue password generate con Haipass <b>vengono MAI SALVATE da nessuna parte</b>. Vedi Haipass come una funzione pura che dati due input: la frase segreta e nome del sito in cui si vuole accedere, ti genererà sempre lo stesso output. Inoltre essendo che tu non ti devi registrare e non hai un account su Haipass non ci sarebbe bisogno di salvare le tue password.",
  "On Haipass passwords are generated given two inputs: your secret phrase and the name of the site that you want to access. Your username or the email  are not used. Although Haipass can know the generated passwords, there is NO way to find out who you are, neither your name, nor your username or your email. So Haipass will never have all the information that is needed to know for access into your account. And again Haipass will never know who you are." : "Su Haipass le password vengono generate dati due input: tua frase segreta e nome del sito. Non viene usato il tuo username o la tua email di registrazione del sito per cui si sta generando la password. Nonostante Haipass può sapere le password generate, non c'è NESSUNA maniera di risalire a chi sei tu, nè al tuo nome, nè alle tue username o email. Quindi Haipass non potrà mai avere tutti i dati necessari per poter conoscere le tue credenziali. E lo ribadisco ancora non potrà mai sapere chi sei tu.",
  "Ok, let me try it!" : "Ok, fammelo provare",
  "Contact me": "Contattami",
  "Terms of Service": "Termini d'uso",
  "Haipass service is offered by Haiaty Varotto Silva Fonseca." : "Il servizio di Haipass è offerto da Haiaty Varotto Silva Fonseca.",
  "The user who wants to use Haipass must know that:" : "L'utente utilizzatore che vuole usare Haipass deve sapere che",
  "Haipass does not keep any of the generated passwords saved in any database." : "Haipass non mantiene nessuna delle password generate salvate in nessun database.",
  "Haipass can not come up in any way to the user's identity." : "Haipass non può risalire in nessuna maniera all'identità dell'utente utilizzatore.",
  "Haipass does not keep any secret phrase in any database, and being unable to know the identity of the user it is not possible in any way to get the secret phrase back." : "Haipass non mantiene salvata in nessun database nessuna frase segreta, ed essendo che non può conoscere l'identità dell'utente non può in nessuna maniera riavere la frase segreta.",
  "You must keep your secret passprhase with care, because if you lose it you will need to reset your passwords using another secret phrase. If it is discovered or stolen, you must immediately change it, and then change your passwords on all platforms where you have used password haipass." : "deve mantenere con ogni cura la propria frase segreta perchè se la perde dovrà reimpostare le sue password usando un'altra frase segreta. Se invece viene scoperta o rubata deve immeditamente cambiarla e quindi apportare i cambi password su tutte le piattaforme dove usa haipass per la password.",
  "If the site has some malfunctioning or disservice you will not be able to have your passwords during the time the site is down. If this happens, i advice the user to change temporaly the password of the account that you need to access." : "se il sito dovesse avere qualche malfunzionamento o disservizio non potrà avere le proprie password nel periodo in cui il sito ha il disservizio, compreso completo down. Se dovesse succedere consiglio all'utente di cambiare provisoriamente la password all'account in cui deve accedere. Detto questo ovviamente mi impegnerò affinchè non ci siano disservizi o malfunzionamenti.",
  "The user also has the following prohibitions:" : "L'utente utilizzatore inoltre ha i seguenti divieti:",
  "Copy the content of the site and its idea." : "Copiare il contenuto del sito e la sua idea.",
  "Try to hack the site in any way without a written consent." : "provare ad hackerare il sito in qualsiasi maniera senza un consenso scritto.",
  "The Haipass owner is not liable in any way for any damages or problems related to the use of Haipass. It is also not liable if the secret phrase is discovered in any way due to a lack of the user." : "Il titolare di Haipass non è responsabile in nessuna maniera per qualsiasi danno o problema legato all'utilizzo di Haipass. Altresì non è responsabile nel caso la frase segreta venga scoperta in qualsiasi maniera dovuto ad una mancanza dell'utente.",
  "The Haipass owner is not responsible for any damages or problems caused by any malfunction of the service or site. You must be aware that due to any malfunction of the site you will not be able to have your passwords during the malfunction period." : "Il titolare di Haipass non è responsabile in nessuna maniera per qualsiasi danno o problema legato all'utilizzo di Haipass. Altresì non è responsabile nel caso la frase segreta venga scoperta in qualsiasi maniera dovuto ad una mancanza dell'utente.",
  "Ok, i understood" : "Ok, ho capito",
  "Haipass.com does not save anywhere the passwords that are generated" : "Haipass.com non salva da nessuna parte le password che vengono generate.",
  "The information that is collected is information about the Http requests and the number of passwords that are generated for statistics purposes." : "Le informazioni che vengono raccolte sono le informazioni sulla richiesta Http a fine statistici e il numero di password che vengono generate.",
  "Haipass - strong passwords never forgotten" : "Haipass - password forti mai dimenticate",
  "Tips" : "Suggerimenti",
  "Some useful tips" : "Alcuni suggerimenti utili",
  "Do not use a simple secret phrase and if possible, use unrelated words between them." : "Non usare una frase segreta semplice e utilizza se possibile parole scorrelate fra loro.",
  "Since there are keyloggers (programs that intercept what you type) that can not even be detected by antivirus, it would be a good practice if instead of typing your secret phrase, you copy it from a file or from somewhere else." : "Essendo che esistono keyloggers (programmi che intercettano quello che digiti) che non sono individuabili nemmeno da computer con antivirus, sarebbe una buona pratica se anzichè digitare la tua frase segreta tu la incolassi dopo averla copiata da un file (magari chiamato con un nome che non faccia capire che si tratti di un filedi password e sarebbe meglio anche se ci fossero altre scritte scorrelate dalla tua frase segreta).",
  "As long as you are on the computer you can leave the field of the compiled secret phrase. So when you need a password you do not have to rewrite the secret phrase." : "Finchè sei al computer puoi lasciare il campo della frase segreta compilato. Cosi quando ti serve una password non devi ridigitare la frase segreta.",
  "Enables 2-factor authentication on websites that are most important for you." : "Abilita l'autenticazione a 2 fattori sui siti web che per te sono i più importanti.",
  "If you need to change your password, for example every 3 months, you can add a number after the site name. Example: For the first password of facebook use 'facebook' as the name of the site, for the second password use 'facebook2' and so on .." : "Se hai bisogno di cambiare la password, ad esempio ogni 3 mesi, puoi aggiungere un numero dopo il nome del sito. Esempio: per la prima password di facebook usi 'facebook' come nome del sito, per la seconda password usi 'facebook2' e cosi via..",
  "show" : "Mostra",
  "Hide" : "Nascondi",
  "My Password" : "La mia password",
  "Website or application name": "Nome sito web o applicazione",
  "Secret passphrase" : "Frase segreta",
  "Here is your password" : "Ecco la tua password",
  "Haipass is a FREE service to help you have strong, long, complicated passwords for your accounts without you having to remember them." : "Haipass è un servizio GRATUITO per aiutarti ad avere delle password forti, lunghe e complicate, per i tuoi account, senza che tu debba ricordarle.",
  "meta-tags" : "password, generatore di password, password forti, smart password manager",
  "put the word 'Facebook' in the first field, put your secret phrase that you have used for the first time in the second field and click the 'My Password' button. Copy your password and use it to log in." : "metti 'facebook' nel primo campo, metti la frase segreta (quella che hai usato al punto 1) e clicca il pulsante 'La mia password'.Copia la tua password e usala per loggarti. "

}
